
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        2 |           3 |          0 |
## Affected resources by action

|  Action  | Resources                                                                           |
|:--------:|:------------------------------------------------------------------------------------|
|    🟢    | `module.terraform-aws-github-backup.aws_key_pair.deployer`                          |
|    🟢    | `module.terraform-aws-github-backup.tls_private_key.deployer`                       |
|    🟡    | `module.terraform-aws-github-backup.aws_autoscaling_group.main`                     |
|    🟡    | `module.terraform-aws-github-backup.aws_launch_template.github-backup`              |
|    🟡    | `module.terraform-aws-github-backup.module.instance_profile.aws_iam_policy.profile` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.terraform-aws-github-backup.aws_autoscaling_group.main will be updated in-place
  ~ resource "aws_autoscaling_group" "main" {
        id                               = "infrahouse-github-backup2024100900462755050000000420241009004628273000000006"
        name                             = "infrahouse-github-backup2024100900462755050000000420241009004628273000000006"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "18" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      + tag {
          + key                 = "module_version"
          + propagate_at_launch = true
          + value               = "0.6.3"
        }

        # (10 unchanged blocks hidden)
    }

  # module.terraform-aws-github-backup.aws_key_pair.deployer will be created
  + resource "aws_key_pair" "deployer" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = (known after apply)
      + key_name_prefix = "infrahouse-github-backup-deployer-generated-"
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/github-backup/aws"
          + "environment"       = "production"
          + "service"           = "infrahouse-github-backup"
        }
      + tags_all        = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/github-backup/aws"
          + "environment"       = "production"
          + "service"           = "infrahouse-github-backup"
        }
    }

  # module.terraform-aws-github-backup.aws_launch_template.github-backup will be updated in-place
  ~ resource "aws_launch_template" "github-backup" {
        id                                   = "lt-05453df9000ac85e1"
      ~ key_name                             = "aleks" -> (known after apply)
      ~ latest_version                       = 18 -> (known after apply)
        name                                 = "infrahouse-github-backup20241009004627550500000004"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.terraform-aws-github-backup.tls_private_key.deployer will be created
  + resource "tls_private_key" "deployer" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.terraform-aws-github-backup.module.instance_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::493370826424:policy/infrahouse-github-backup-751a7bdf6v3220241009004625392800000001"
        name             = "infrahouse-github-backup-751a7bdf6v3220241009004625392800000001"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = "secretsmanager:GetSecretValue"
                        Effect   = "Allow"
                        Resource = "arn:aws:secretsmanager:us-west-1:493370826424:secret:infrahouse-github-backup20241008175604274900000001-WxRbWT"
                    },
                  + {
                      + Action   = "ec2:DescribeInstances"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiAzLCAiZGVzdHJveSI6IDB9fQ==
```
</details>